Revit 2027 API
ParameterTypeId.MepAnalyticalEquipmentName Property
 "Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MepAnalyticalEquipmentName { get; }
Public Shared ReadOnly Property MepAnalyticalEquipmentName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MepAnalyticalEquipmentName {
	ForgeTypeId^ get ();
}
static member MepAnalyticalEquipmentName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace